РазработкаОУМобильная/src/Catalogs/УГМК_ТехнологическаяОснастка/УГМК_ТехнологическаяОснастка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УГМК_ТехнологическаяОснастка</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ДляПоиска</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УГМК_ТипТехоснастки</name>
    <type>
      <types>CatalogRef.УГМК_ТипыТехнологическихОснасток</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочиеЦентрыПоОснастке</name>
    <type>
      <types>CatalogRef.УГМК_ТехнологическаяОснастка</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>РабочиеЦентры</name>
    <attributes>
      <name>РабочийЦентр</name>
      <type>
        <types>CatalogRef.ГруппыЗаменяемостиРабочихЦентров</types>
        <types>CatalogRef.РабочиеЦентры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительнаяОснастка</name>
    <attributes>
      <name>Оснастка</name>
      <type>
        <types>CatalogRef.УГМК_ТехнологическаяОснастка</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

РазработкаОУМобильная/src/Catalogs/РабочиеЦентры/РабочиеЦентры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РабочиеЦентры</name>
  <comment>(Упр)</comment>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяЗагрузкаПодчиненныхРабочихЦентров</name>
    <comment>Признак того, что при загрузке данного рабочего центра требуется загрузка других рабочих центров и групп заменяемости рабочих центров</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УГМК_ГруппаПродукцииБаланс</name>
    <type>
      <types>CatalogRef.СК_ГруппыПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>УГМК_ДляПоиска</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УГМК_ОсновноеСредство</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ПодчиненныеРабочиеЦентры</name>
    <comment>Таблица подчиненных рабочих центров</comment>
    <attributes>
      <name>РабочийЦентр</name>
      <type>
        <types>CatalogRef.ГруппыЗаменяемостиРабочихЦентров</types>
        <types>CatalogRef.РабочиеЦентры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УГМК_ТипыТехоснасток</name>
    <attributes>
      <name>УГМК_ТипТехоснастки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

РазработкаОУМобильная/src/Catalogs/УГМК_ТехнологическаяОснастка/Forms/ФормаВыборНескольких/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьЗначенияСвойств( ЭтаФорма, Параметры, "Оснастка1,Оснастка2,Оснастка3,РабочийЦентр,УГМК_ТипТехоснастки");
	
	ОбновитьЗаголовкиСервер();
	
	УГМК_ОперативныйУчетВызовСервера.ОбработатьШрифтыФормы( ЭтаФорма, Новый Структура("ГруппаДействия"));
КонецПроцедуры

&НаСервере
Процедура ОбновитьЗаголовкиСервер()
	Элементы.РабочийЦентр.Заголовок = Строка( РабочийЦентр);
	Элементы.УГМК_ТипТехоснастки.Заголовок = Строка( УГМК_ТипТехоснастки);
	Элементы.Оснастка1.Заголовок = Строка( Оснастка1);
	Элементы.Оснастка2.Заголовок = Строка( Оснастка2);
	Элементы.Оснастка3.Заголовок = Строка( Оснастка3);
КонецПроцедуры

&НаКлиенте
Процедура ОснасткаВыбор( ИмяЭлемента)
	ПараметрыВ = Новый Структура;
	ПараметрыВ.Вставить("РабочийЦентр", РабочийЦентр);
	ПараметрыВ.Вставить("УГМК_ТипТехоснастки", УГМК_ТипТехоснастки);
	ПараметрыВ.Вставить("ТекущаяСтрока", ЭтаФорма[ ИмяЭлемента]);
	
	НоваяОснастка = ОткрытьФормуМодально("Справочник.УГМК_ТехнологическаяОснастка.Форма.ФормаВыбора", ПараметрыВ, ЭтаФорма);
	Если ЗначениеЗаполнено( НоваяОснастка) Тогда
		ЭтаФорма[ ИмяЭлемента] = НоваяОснастка;
		Элементы[ ИмяЭлемента].Заголовок = Строка( НоваяОснастка);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РабочийЦентр(Команда)
	ПараметрыВ = Новый Структура;
	ПараметрыВ.Вставить("ТекущаяСтрока", РабочийЦентр);
	РабочийЦентрРез = ОткрытьФормуМодально("Справочник.РабочиеЦентры.Форма.ФормаВыбораУправляемая", ПараметрыВ, ЭтаФорма);
	Если ЗначениеЗаполнено( РабочийЦентрРез) Тогда
		РабочийЦентр = РабочийЦентрРез;
		ОбновитьЗаголовкиСервер();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТипОснастки(Команда)
	ПараметрыВ = Новый Структура;
	ПараметрыВ.Вставить("РабочийЦентр", РабочийЦентр);
	ПараметрыВ.Вставить("ТекущаяСтрока", УГМК_ТипТехоснастки);
	УГМК_ТипТехоснасткиРез = ОткрытьФормуМодально("Справочник.УГМК_ТипыТехнологическихОснасток.Форма.ФормаВыбора", ПараметрыВ, ЭтаФорма);
	Если ЗначениеЗаполнено( УГМК_ТипТехоснасткиРез) Тогда
		УГМК_ТипТехоснастки = УГМК_ТипТехоснасткиРез;
		ОбновитьЗаголовкиСервер();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Оснастка1(Команда)
	ОснасткаВыбор("Оснастка1");
КонецПроцедуры

&НаКлиенте
Процедура Оснастка2(Команда)
	ОснасткаВыбор("Оснастка2");
КонецПроцедуры

&НаКлиенте
Процедура Оснастка3(Команда)
	ОснасткаВыбор("Оснастка3");
КонецПроцедуры

&НаКлиенте
Процедура РЦОчистить(Команда)
	РабочийЦентр = Неопределено;
	ОбновитьЗаголовкиСервер();
КонецПроцедуры

&НаКлиенте
Процедура ТипОснасткиОчистить(Команда)
	УГМК_ТипТехоснастки = Неопределено;
	ОбновитьЗаголовкиСервер();
КонецПроцедуры

&НаКлиенте
Процедура Оснастка1Очистить(Команда)
	Оснастка1 = Неопределено;
	ОбновитьЗаголовкиСервер();
КонецПроцедуры

&НаКлиенте
Процедура Оснастка2Очистить(Команда)
	Оснастка2 = Неопределено;
	ОбновитьЗаголовкиСервер();
КонецПроцедуры

&НаКлиенте
Процедура Оснастка3Очистить(Команда)
	Оснастка3 = Неопределено;
	ОбновитьЗаголовкиСервер();
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	Результат = Новый Структура("РабочийЦентр,Оснастка1,Оснастка2,Оснастка3");
	ЗаполнитьЗначенияСвойств( Результат, ЭтаФорма);
	Закрыть( Результат);
КонецПроцедуры
